In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.3.1'

In [4]:
df = pd.read_csv('iris.csv')

In [5]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.head()
df.info()
df.describe()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [8]:
df.iloc[:,-1]

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

In [10]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [11]:
data = df.iloc[:,:-1].values
data.shape, type(data)

((150, 4), numpy.ndarray)

In [12]:
import numpy as np

In [13]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [15]:
# col 추가하기
df['aaa']=df['sepal.length']-df['petal.length']
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety  aaa
0           5.1          3.5           1.4          0.2  Setosa  3.7
1           4.9          3.0           1.4          0.2  Setosa  3.5
2           4.7          3.2           1.3          0.2  Setosa  3.4
3           4.6          3.1           1.5          0.2  Setosa  3.1
4           5.0          3.6           1.4          0.2  Setosa  3.6

In [19]:
mask = df['sepal.length']>6
df[mask]

     sepal.length  sepal.width  petal.length  petal.width     variety  aaa
50            7.0          3.2           4.7          1.4  Versicolor  2.3
51            6.4          3.2           4.5          1.5  Versicolor  1.9
52            6.9          3.1           4.9          1.5  Versicolor  2.0
54            6.5          2.8           4.6          1.5  Versicolor  1.9
56            6.3          3.3           4.7          1.6  Versicolor  1.6
..            ...          ...           ...          ...         ...  ...
144           6.7          3.3           5.7          2.5   Virginica  1.0
145           6.7          3.0           5.2          2.3   Virginica  1.5
146           6.3          2.5           5.0          1.9   Virginica  1.3
147           6.5          3.0           5.2          2.0   Virginica  1.3
148           6.2          3.4           5.4          2.3   Virginica  0.8

[61 rows x 6 columns]

In [21]:
#p.135 누락된 데이터 처리하기
vasls1 = np.array([1,None,2,3])
vasls1

array([1, None, 2, 3], dtype=object)

In [ ]:
vasls1.sum() # 파이썬은 None을 사용한 산술 연산을 지원하지 X

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [23]:
%timeit np.arange(1E6, dtype= int).sum()

2.4 ms ± 143 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [24]:
%timeit np.arange(1E6, dtype= object).sum()

39.6 ms ± 196 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [26]:
vasls2 = np.array([1,np.nan,3,4])
vasls2.dtype

dtype('float64')

In [27]:
1+np.nan

nan

In [28]:
0*np.nan

nan

In [29]:
vasls2.sum(), vasls2.min(),vasls2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [30]:
# 누락된 값을 무시하는 특별한 집계 연산
np.nansum(vasls2), np.nanmin(vasls2), np.nanmax(vasls2)

(np.float64(8.0), np.float64(1.0), np.float64(4.0))

In [31]:
pd.Series([1,np.nan, 2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [32]:
x = pd.Series(range(2),dtype=int)
x

0    0
1    1
dtype: int64

In [33]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [34]:
df2 = pd.read_csv('iris copy.csv')
df2.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           NaN          0.2  Setosa
3           NaN          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [35]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  149 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  149 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [40]:
# p.145 계층적 인덱싱 
import yfinance as yf

In [46]:
yf.download(['MSFT','APPL'],period = '1mo')

C:\Users\user\AppData\Local\Temp\ipykernel_972\3579443017.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  yf.download(['MSFT','APPL'],period = '1mo')
[*********************100%***********************]  2 of 2 completed

1 Failed download:
['APPL']: YFPricesMissingError('possibly delisted; no price data found  (period=1mo)')

Price      Adj Close Close             High              Low             Open  \
Ticker          APPL  APPL        MSFT APPL        MSFT APPL        MSFT APPL
Date
2025-06-20       NaN   NaN  477.399994  NaN  483.459991  NaN  476.869995  NaN
2025-06-23       NaN   NaN  486.000000  NaN  487.750000  NaN  472.510010  NaN
2025-06-24       NaN   NaN  490.109985  NaN  491.850006  NaN  486.799988  NaN
2025-06-25       NaN   NaN  492.269989  NaN  494.559998  NaN  489.390015  NaN
2025-06-26       NaN   NaN  497.450012  NaN  498.040009  NaN  492.809998  NaN
2025-06-27       NaN   NaN  495.940002  NaN  499.299988  NaN  493.029999  NaN
2025-06-30       NaN   NaN  497.410004  NaN  500.760010  NaN  495.329987  NaN
2025-07-01       NaN   NaN  492.049988  NaN  498.049988  NaN  490.980011  NaN
2025-07-02       NaN   NaN  491.089996  NaN  493.500000  NaN  488.700012  NaN
2025-07-03       NaN   NaN  498.839996  NaN  500.130005  NaN  493.440002  NaN
2025-07-07       NaN   NaN  497.720001  NaN  498.750000  NaN  495.230011  NaN
2025-07-08       NaN   NaN  496.619995  NaN  498.200012  NaN  494.109985  NaN
2025-07-09       NaN   NaN  503.510010  NaN  506.779999  NaN  499.739990  NaN
2025-07-10       NaN   NaN  501.480011  NaN  504.440002  NaN  497.750000  NaN
2025-07-11       NaN   NaN  503.320007  NaN  505.029999  NaN  497.799988  NaN
2025-07-14       NaN   NaN  503.019989  NaN  503.970001  NaN  501.029999  NaN
2025-07-15       NaN   NaN  505.820007  NaN  508.299988  NaN  502.790009  NaN
2025-07-16       NaN   NaN  505.619995  NaN  506.720001  NaN  501.890015  NaN
2025-07-17       NaN   NaN  511.700012  NaN  513.369995  NaN  505.619995  NaN
2025-07-18       NaN   NaN  510.049988  NaN  514.640015  NaN  507.429993  NaN

Price                  Volume
Ticker            MSFT   APPL      MSFT
Date
2025-06-20  482.230011    NaN  37576200
2025-06-23  478.209991    NaN  24864000
2025-06-24  488.950012    NaN  22305600
2025-06-25  492.040009    NaN  17495100
2025-06-26  492.980011    NaN  21578900
2025-06-27  497.549988    NaN  34539200
2025-06-30  497.040009    NaN  28369000
2025-07-01  496.470001    NaN  19945400
2025-07-02  489.989990    NaN  16319600
2025-07-03  493.809998    NaN  13984800
2025-07-07  497.380005    NaN  13981600
2025-07-08  497.239990    NaN  11846600
2025-07-09  500.299988    NaN  18659500
2025-07-10  503.049988    NaN  16492100
2025-07-11  498.470001    NaN  16459500
2025-07-14  501.519989    NaN  12058800
2025-07-15  503.019989    NaN  14927200
2025-07-16  505.179993    NaN  15154400
2025-07-17  505.679993    NaN  17503100
2025-07-18  514.479980    NaN  21203400

In [ ]:
df.index.is_monotonic_increasing

In [44]:
# p.161-167 데이터 세트 결합
import pandas as pd
import numpy as np

def make_df(cols,ind):
    data = {c:[str(c)+str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [ ]:
# numpy의 배열 연결
x = [1,2,3]
y = [4,5,6]
z = [7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [47]:
x = [[1,2],[3,4]]
np.concatenate([x,x],axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [ ]:
# pd.concat을 이용한 간단한 연결
ser1 = pd.Series(['A','B','C'],index=[1,2,3])
ser2 = pd.Series(['D','E','F'],index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [51]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
print(df1), print(df2), print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

(None, None, None)

In [52]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD',[0,1])
print(df3), print(df4), print(pd.concat([df3,df4], axis=1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

(None, None, None)

In [53]:
df = pd.read_csv('iris.csv')
df1 = df.loc(:,['sepal.width', 'sepal.length'])

SyntaxError: invalid syntax (1466275882.py, line 2)

In [60]:
db_state = pd.read_csv('./data/state-abbrevs.csv')
db_state.head(), db_state.shape

(        state abbreviation
 0     Alabama           AL
 1      Alaska           AK
 2     Arizona           AZ
 3    Arkansas           AR
 4  California           CA,
 (51, 2))

In [59]:
db_area = pd.read_csv('./data/state-areas.csv')
db_area.head(), db_area.shape

(        state  area (sq. mi)
 0     Alabama          52423
 1      Alaska         656425
 2     Arizona         114006
 3    Arkansas          53182
 4  California         163707,
 (52, 2))

In [58]:
db_pop = pd.read_csv('./data/state-population.csv')
db_pop.head(), db_pop.shape

(  state/region     ages  year  population
 0           AL  under18  2012   1117489.0
 1           AL    total  2012   4817528.0
 2           AL  under18  2010   1130966.0
 3           AL    total  2010   4785570.0
 4           AL  under18  2011   1125763.0,
 (2544, 4))

In [63]:
db_state.info(), db_area.info(), db_pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state         51 non-null     object
 1   abbreviation  51 non-null     object
dtypes: object(2)
memory usage: 944.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          52 non-null     object
 1   area (sq. mi)  52 non-null     int64
dtypes: int64(1), object(1)
memory usage: 960.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state/region  2544 non-null   object
 1   ages          2544 non-null   object
 2   year          2544 non-null   int64
 3   population    2524 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 79.6+ KB

(None, None, None)

In [ ]:
# select s.state, s.abbreviation, a.area (sq. mi), p.population
# from state s, area a, population p 
# where s.state = a.state 
#         and s.abbreviation = p. state/region

In [ ]:
# pandas에서의 join 역할 -> merge() 이용하기
pd.merge()

In [69]:
# p.169
m_df = pd.merge(db_state, db_area, how='inner', left_on='state', right_on='state')
m_df

                   state abbreviation  area (sq. mi)
0                Alabama           AL          52423
1                 Alaska           AK         656425
2                Arizona           AZ         114006
3               Arkansas           AR          53182
4             California           CA         163707
5               Colorado           CO         104100
6            Connecticut           CT           5544
7               Delaware           DE           1954
8   District of Columbia           DC             68
9                Florida           FL          65758
10               Georgia           GA          59441
11                Hawaii           HI          10932
12                 Idaho           ID          83574
13              Illinois           IL          57918
14               Indiana           IN          36420
15                  Iowa           IA          56276
16                Kansas           KS          82282
17              Kentucky           KY          40411
18             Louisiana           LA          51843
19                 Maine           ME          35387
20               Montana           MT         147046
21              Nebraska           NE          77358
22                Nevada           NV         110567
23         New Hampshire           NH           9351
24            New Jersey           NJ           8722
25            New Mexico           NM         121593
26              New York           NY          54475
27        North Carolina           NC          53821
28          North Dakota           ND          70704
29                  Ohio           OH          44828
30              Oklahoma           OK          69903
31                Oregon           OR          98386
32              Maryland           MD          12407
33         Massachusetts           MA          10555
34              Michigan           MI          96810
35             Minnesota           MN          86943
36           Mississippi           MS          48434
37              Missouri           MO          69709
38          Pennsylvania           PA          46058
39          Rhode Island           RI           1545
40        South Carolina           SC          32007
41          South Dakota           SD          77121
42             Tennessee           TN          42146
43                 Texas           TX         268601
44                  Utah           UT          84904
45               Vermont           VT           9615
46              Virginia           VA          42769
47            Washington           WA          71303
48         West Virginia           WV          24231
49             Wisconsin           WI          65503
50               Wyoming           WY          97818

In [70]:
s_df = pd.merge( db_pop, m_df, left_on='state/region', right_on='abbreviation')
s_df

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
0,AL,under18,2012,1117489.0,Alabama,AL,52423
1,AL,total,2012,4817528.0,Alabama,AL,52423
2,AL,under18,2010,1130966.0,Alabama,AL,52423
3,AL,total,2010,4785570.0,Alabama,AL,52423
4,AL,under18,2011,1125763.0,Alabama,AL,52423
...,...,...,...,...,...,...,...
2443,WY,under18,1993,137458.0,Wyoming,WY,97818
2444,WY,total,1991,459260.0,Wyoming,WY,97818
2445,WY,under18,1991,136720.0,Wyoming,WY,97818
2446,WY,under18,1990,136078.0,Wyoming,WY,97818
2447,WY,total,1990,453690.0,Wyoming,WY,97818

In [ ]:
# select s.state, s.abbreviation, a.area (sq. mi), p.population
# from population p left out join state s on s.abbreviation = p. state/region
#           and state s inner join area a on s.state = a.state

In [71]:
s_df = pd.merge( db_pop, m_df, how='left' ,left_on='state/region', right_on='abbreviation')
s_df

,state/region,ages,year,population,state,abbreviation,area (sq. mi)
0,AL,under18,2012,1117489.0,Alabama,AL,52423.0
1,AL,total,2012,4817528.0,Alabama,AL,52423.0
2,AL,under18,2010,1130966.0,Alabama,AL,52423.0
3,AL,total,2010,4785570.0,Alabama,AL,52423.0
4,AL,under18,2011,1125763.0,Alabama,AL,52423.0
...,...,...,...,...,...,...,...
2539,USA,total,2010,309326295.0,NaN,NaN,NaN
2540,USA,under18,2011,73902222.0,NaN,NaN,NaN
2541,USA,total,2011,311582564.0,NaN,NaN,NaN
2542,USA,under18,2012,73708179.0,NaN,NaN,NaN
2543,USA,total,2012,313873685.0,NaN,NaN,NaN